Repository: 84000/data-translation-memory
Catalog: toh61-v4.tmx
Source language: bo
Languages: en

source: །གཞན་ཡང་མཽད་གལ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ཀྱི་ཚེ་འཛམ་བུའི་གླིང་འདིར་ནད་ཀྱི་བསྐལ་པ་ཆེན་པོ་བྱུང་བས་སེམས་ཅན་རྣམས་ནད་ཀྱིས་ཉོན་མོངས་པར་གྱུར་ཏོ། །དེའི་ཚེ་འཛམ་བུའི་གླིང་གི་རྒྱལ་པོ་དབང་ཕྱུག་གི་སྡེ་ཞེས་བྱ་བ་གྲོང་ཁྱེར་ཆེན་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ལ་དབང་བྱེད་ཅིང་མཐུ་ཆེན་པོ་དང་ལྡན་པ་ཞིག་བྱུང་བར་གྱུར་ཏོ།
en: “Furthermore, Maudgalyāyana, in the past, there was a great eon of sickness here in this world of Jambudvīpa, during which Īśvarasena appeared in the world. He ruled over eighty-four thousand cities and possessed great powers.

source: །དེའི་ཚེ་རྒྱལ་པོ་དེའི་བཙུན་མོ་དམ་པ་སེམས་ཅན་དང་ལྡན་པར་གྱུར་ཏེ། དེའི་ལུས་ཀྱི་ཡན་ལག་གམ། ལག་པས་སེམས་ཅན་རྣམས་ལ་རེག་པ་ཙམ་གྱིས་ནད་ཐམས་ཅད་སོས་པར་གྱུར་ཏོ།
en: At one point, while his principal queen was pregnant, she could cure others’ diseases merely by touching them with her hands or other body parts.

source: །ཟླ་བ་ཚང་ནས་བུ་ཁྱེའུ་ཞིག་བཙས་པ་དང་། བཙས་མ་ཐག་ཏུ་འདི་སྐད་དུ་བདག་ནི་ནད་པ་རྣམས་གསོ་བར་ནུས་སོ་ཞེས་སྨྲས་སོ།
en: Eventually, when her pregnancy came to its term, she gave birth to a son. As soon as her son was born, he proclaimed, ‘I have the power to cure all diseases.’

source: །གཞན་ཡང་བཙས་པའི་ཚེ་འཛམ་བུའི་གླིང་གི་ལྷ་ཀླུ་རྣམས་ཀྱིས་འཐུན་པར་འདི་སྐད་དུ་དེང་རྒྱལ་པོའི་བུ་བཙས་པ་འདི་ནི་མིའི་སྨན་ཡིན་ནོ་ཞེས་སྨྲས་པས། དེ་སྐད་སྨྲས་པའི་སྒྲ་དེ་ཀུན་དུ་གྲགས་པའི་ཕྱིར་མིང་ཡང་མིའི་སྨན་ཞེས་བཏགས་སོ།
en: “The moment he was born, the gods and spirits of the world proclaimed in unison, ‘This newborn son of the king is a Healer of Men!’ Since those words were heard everywhere, he was given the name Healer of Men.

source: །དེའི་ཚེ་མི་རྣམས་ཀྱང་གང་ནད་ཀྱིས་བཏབ་པ་རྣམས་ཁྲིད་ནས་རྒྱལ་བུ་དེ་ལ་བསྟན་པ་དང་། ནད་པ་གང་རྒྱལ་བུའི་དྲུང་དུ་ཕྱིན་པ་དེ་དག་རྒྱལ་བུའི་ལག་པས་རེག་པར་གྱུར་ཏམ། ལུས་ཀྱིས་རེག་པར་གྱུར་ཀྱང་རུང་སྟེ། ཐམས་ཅད་ནད་སོས་ནས་བདེ་བ་ཐོབ་པར་གྱུར་ཏོ།
en: “People who were afflicted by diseases were led to the prince and shown to him. He would then touch them with his hands or with another part of his body, thereby curing all their diseases and restoring their well-being.

source: །དེ་བཞིན་དུ་འཛམ་བུའི་གླིང་ན་གནས་པ་ཀུན་གྱིས་ནད་པ་ཁྲིད་ནས་རྒྱལ་བུ་དེ་ལ་བསྟན་པ་དང་། རྒྱལ་བུའི་ལག་པས་རེག་པ་ཙམ་གྱིས་ནད་ཐམས་ཅད་སོས་ནས་མཆོག་ཏུ་བདེ་བ་ཐོབ་པར་གྱུར་ཏོ།
en: In this way, all sick persons living in the world were taken to the prince and shown to him. By merely touching them with his hands, all their diseases were cured and their well-being was totally restored.

source: །མཽད་གལ་རྒྱལ་བུ་མིའི་སྨན་གྱིས་ལོ་སྟོང་གི་བར་དུ་དེ་ལྟར་ནད་གསོས་ནས་དེའི་འོག་ཏུ་འཆི་བའི་དུས་བྱས་སོ།
en: Maudgalyāyana, after Healer of Men had cured diseases in that way for a thousand years, he passed away.

source: །འཆི་བའི་དུས་བྱས་པའི་འོག་ཏུ་ནད་པ་རྣམས་དེར་འོངས་ནས་འཆི་བའི་དུས་བྱས་པ་ཐོས་པ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་བཏོན་ཏེ་ངུས་ནས་སུ་ཞིག་བདག་ཅག་ན་བའི་སྡུག་བསྔལ་ལས་ཐར་པར་བྱེད་ཅེས་སྨྲས་སོ། །ནད་ཀྱིས་བཏབ་པ་རྣམས་རྒྱལ་བུ་མིའི་སྨན་གང་དུ་བསྲེགས་པ་སྨྲས་ནས་གང་དུ་བསྲེགས་པ་ཤེས་པར་གྱུར་པ་དང་། བསྲེགས་པའི་གནས་དེར་རུས་པ་བླངས་ཏེ།
en: After he died, sick persons still came to see him but, hearing of his death, they despaired and cried out of grief, ‘Who will now liberate us from the suffering of our sicknesses?’ So they inquired where the prince Healer of Men had been cremated and, once they knew where the cremation had taken place, they went there, collected his bones, and crushed them into a powder.

source: ཕྱེ་མར་བཏགས་ནས་ལུས་ལ་བསྐུས་པ་དང་། ཐམས་ཅད་ནད་སོས་པར་གྱུར་ནས་འདི་སྐད་དུ་རྒྱལ་བུ་མིའི་སྨན་ད་དུང་ཡང་ན་བ་རྣམས་གསོ་བར་ནུས་སོ་ཞེས་སྨྲས་སོ།
en: When they rubbed their bodies with this powder, all their diseases were cured, and they exclaimed, ‘The prince Healer of Men still has the power to cure sicknesses!’

source: །མཽད་གལ་དེ་ལྟར་ནད་པ་རྣམས་གསོས་པའི་རྒྱུ་དང་རྐྱེན་གྱིས་རུས་པ་རྣམས་ཀྱང་མཐར་གྱིས་ཟད་པར་གྱུར་ཏོ།
en: “Maudgalyāyana, since they were used in that way to cure diseases, the bones gradually became exhausted.

source: །རུས་པ་རྣམས་ཟད་པའི་འོག་ཏུ་བསྲེགས་པའི་གནས་དེར་སོང་ནས་ས་དང་། ཐལ་བ་དང་། སོལ་བ་རྣམས་བླངས་ཏེ་སོ་སོ་ནས་ལུས་ལ་བསྐུས་པ་དང་། ནད་ཐམས་ཅད་སོས་པར་གྱུར་ཏེ།
en: After all the bones had been used, sick persons would come to the cremation ground and pick up earth, ashes, or charcoal. When they rubbed those substances on their bodies, they too became healed from all their diseases.

source: མཽད་གལ་དེ་ལྟར་རྒྱལ་བུ་མིའི་སྨན་གྱིས་ནད་ཀྱི་བསྐལ་པ་ཆེན་པོ་བྱུང་བ་ན་ཐབས་མཁས་པས་ནད་ཀྱིས་བཏབ་པ་རྣམས་གསོས་པ་ཡིན་ནོ།
en: Maudgalyāyana, in that way, during the great eon of sickness, the prince Healer of Men healed those persons afflicted by sicknesses through such skillful means.

source: །མཽད་གལ་ཁྱོད་ཀྱིས་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་བུ་མིའི་སྨན་ཞེས་བྱ་བ་བྱུང་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ། དེ་ནི་ང་ཉིད་ཡིན་ཏེ། ངས་ནད་ཀྱི་སྡུག་བསྔལ་མང་བའི་སེམས་ཅན་མགོན་མེད་པ། སྐྱབས་མེད་པ་དག་གི་ནད་གསོས་སོ། །
en: “Maudgalyāyana, at that time, I was this prince called Healer of Men who cured the diseases of those unprotected and defenseless sentient beings afflicted by the intense suffering of sickness. Do not think that this was someone else.

source: ངས་དེང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་ཤེས་རབ་ཆེན་པོའི་སྨན་གྱིས་སེམས་ཅན་རྣམས་གསོས་ནས་སྡུག་བསྔལ་མཐར་ཟད་པར་བྱས་སོ།
en: After I awoke to unsurpassed and perfect buddhahood, I began healing sentient beings with the medicine of great insight, bringing their sufferings to a complete end.

source: །མཽད་གལ་ང་ནི་སེམས་ཅན་གྱི་ཆེད་དུ་ལུས་གང་བླངས་པས་ཕན་འདོགས་པར་གྱུར་པ་དེ་བཞིན་དུ་ལེན་ཅིང་ཕན་འདོགས་པར་བྱེད་པས་མཽད་གལ་རྒྱུ་དང་རྐྱེན་དེས་ན་ཆེད་དུ་སེམས་ཅན་གྱི་ཕྱིར་ལུས་བླངས་ནས་ཕན་འདོགས་པ་ཡིན་པར་རིག་པར་བྱའོ།
en: Maudgalyāyana, just as I benefitted sentient beings by taking birth for their sake, you should know that, as a consequence of those acts, I have now once again deliberately taken birth in order to benefit sentient beings.

source: །གཞན་ཡང་མཽད་གལ་སྔོན་བྱུང་བ་འདས་པའི་དུས་ཀྱི་ཚེ་ང་གཅིག་པུ་གྲོགས་མེད་པར་སོང་བ་ལས་གཅན་གཟན་མ་རུངས་པ་ཞིག་འོངས་ཏེ་ངའི་སྲོག་བཅད་ནས་ངའི་ཤ་བཟའ་བར་འདོད་པ་ལས་ང་འཆི་ཀའི་དུས་ཀྱི་ཚེ་སེམས་བསྐྱེད་ནས་འདི་སྐད་དུ་བདག་འཆི་བའི་དུས་བྱས་པའི་འོག་ཏུ་དགོན་པའི་ནགས་ཚལ་འདིར་དུད་འགྲོ་ལུས་པོ་ཆེ་ཞིག་ཏུ་སྐྱེས་ནས་གཅན་གཟན་མ་རུངས་པ་གང་གིས་བདག་གི་སྲོག་བཅད་པ་དེ་དག་འགྲངས་ཤིང་ཚིམ་པར་བྱེད་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་པོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: “Furthermore, Maudgalyāyana, in the past, I was once walking alone, without any friend, when a ferocious predator wanting to kill me and eat my flesh appeared in front of me. Just before I died, I gave rise to the mind set on awakening and made this aspiration, ‘After I die, may I be reborn as a large animal in this isolated forest, and may some ferocious predators kill me and thereby become fulfilled and satisfied.’ Why did I make this aspiration?

source: གཅན་གཟན་མ་རུངས་པ་དེ་དག་ནི་རྟག་པར་སྲོག་ཆགས་ཕྲ་མོ་གསོད་ཅིང་ཤ་ཟ་བར་བྱས་པས་སྲོག་བཅད་པའི་ཁ་ན་མ་ཐོ་བ་མང་དུ་བསྐྱེད་ཀྱང་འགྲངས་ཤིང་ཚིམ་པར་མི་འགྱུར་བས་ངས་འདི་སྐད་དུ་བདག་འདིར་དུད་འགྲོ་ལུས་པོ་ཆེར་སྐྱེས་ནས་ཤ་ཟ་ཞིང་ཁྲག་འཐུང་བའི་སེམས་ཅན་རྣམས་འགྲངས་ཞིང་ཚིམ་པར་བྱེད་པར་གྱུར་ཅིག་ཅེས་སྨོན་ལམ་བཏབ་པས་ན།
en: Because those ferocious predators always kill and eat the flesh of small animals, and so they repeatedly commit the wrongdoing of killing. Nevertheless, they never feel satiated and satisfied. This is the reason why I made the aspiration, ‘May I be reborn here as a large animal, and may I bring fulfillment and satisfaction to those flesh eaters and blood drinkers.’

source: འཆི་བའི་དུས་བྱས་མ་ཐག་ཏུ་དེར་དུད་འགྲོ་ལུས་པོ་ཆེར་རྫུས་ཏེ་སྐྱེས་ནས་གཅན་གཟན་མ་རུངས་པ་ཤ་ཟ་ཞིང་ཁྲག་འཐུང་བ་རྣམས་འགྲངས་ཤིང་ཚིམ་པར་བྱས་པ་ཡིན་ནོ།
en: “As soon as I died, I was miraculously reborn in that forest as a large animal, bringing fulfillment and satisfaction to the ferocious flesh-eating and blood-drinking predators.

source: །དེ་བཞིན་དུ་ཚེ་རབས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་སྙེད་དུ་ཆེད་དུ་ལུས་བླངས་ནས་སེམས་ཅན་རྣམས་ལ་ཕན་པ་བྱས་ཏེ།
en: Similarly, for myriads of lifetimes I have deliberately taken birth to benefit sentient beings.

source: མཽད་གལ་ངས་གལ་ཏེ་བསྐལ་པ་གཅིག་གམ། བསྐལ་པ་ལས་ལྷག་པར་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ་སེམས་ཅན་བཀྲེས་ཤིང་སྐོམ་པ་རྣམས་ལ་རང་གི་ཤ་དང་ཁྲག་གིས་ཚིམ་པར་བྱས་པ་དག་བརྗོད་ན་ཡང་། མཐར་ཐུག་པར་མི་འགྱུར་རོ།
en: Maudgalyāyana, even if I were to spend an eon or more to describe all the instances in the past when I practiced bodhisattva conduct and satisfied sentient beings suffering from hunger and thirst by offering my flesh and blood, there would be no end to those accounts.

source: །མཽད་གལ་དེ་ལྟར་ན་ངས་སྔོན་སེམས་ཅན་སྡུག་བསྔལ་བ་རྣམས་ལ་སྙིང་རྗེའི་སེམས་རབ་ཏུ་བསྐྱེད་པ་ཡིན་ནོ།
en: Maudgalyāyana, in the past, I thus gave rise to a compassionate attitude toward sentient beings afflicted by suffering.

source: །གཞན་ཡང་མཽད་གལ་ངས་མངོན་པར་དྲན་ཏེ། སྔོན་བྱུང་བ་འདས་པའི་དུས་ཀྱི་ཚེ་ངས་སེམས་ཅན་སྡུག་བསྔལ་གྱིས་ཉོན་མོངས་པ་མཐོང་བ་དང་། འདི་སྙམ་དུ་བདག་གིས་སྤངས་ཏེ་ཡོངས་སུ་མི་བསྐྱབ་པའི་མི་རིགས་སོ་སྙམ་དུ་བསམས་ནས་དེ་དག་གི་ཐད་དུ་སོང་ནས་འདི་སྐད་དུ་ཀྱེ་ཁྱེད་ལ་སྡུག་བསྔལ་ཇི་ལྟ་བུ་ཞིག་ཡོད།
en: “Furthermore, Maudgalyāyana, I remember that in the past, I once saw some beings afflicted by suffering. Seeing them, I thought, ‘It would not be right if I were to abandon these beings without protection.’ So I approached them and asked, ‘What kind of suffering are you experiencing?

source: ཅི་ཞིག་འདོད་ཅེས་དྲིས་པ་དང་། དེ་དག་གིས་སྨྲས་པ། དེང་བདག་ཅག་ནི་ཤིན་ཏུ་བཀྲེས་ཤིང་སྐོམ་མོ།
en: What do you wish for?’ “They answered, ‘We are extremely hungry and thirsty!’

source: །ངས་དེ་སྐད་སྨྲས་པ་ཐོས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱེད་བཟའ་བ་དང་བཏུང་བ་ཇི་ལྟ་བུ་ཞིག་འདོད།
en: “Upon hearing those words, I replied, ‘What kind of food and drink do you want?’

source: དེ་དག་གིས་ང་ལ་བདག་ཅག་ནི་ཁྲག་འཐུང་ཞིང་ཤ་ཟ་བ་ཡིན་པས་གལ་ཏེ་ལུས་ཀྱི་ཤ་དང་ཁྲག་བདག་ཅག་ལ་བྱིན་ན་ནི་བདག་ཅག་གདོད་བདེ་ཞིང་ནད་མེད་པར་འགྱུར་རོ་ཞེས་སྨྲས་པ་དང་། ངས་དེ་དག་ལ་དེ་བཞིན་དུ་གནང་ནས་རང་ཉིད་ཀྱི་ཤ་བཅད་ཁྲག་ཕྱུང་ནས་སེམས་ཅན་དེ་དག་ལ་བྱིན་ཡང་།
en: “They replied, ‘We are blood drinkers and flesh eaters. If you give us flesh and blood, we will become pleased and healthy.’ So I granted them what they wanted by cutting off my flesh, drawing blood from my body, and offering this to them.

source: མཽད་གལ་དེའི་ཚེ་ངའི་སེམས་འགྱོད་ཅིང་ཕངས་པ་ཡང་མེད། མྱ་ངན་ཡང་མེད། བྱིང་བ་ཡང་མེད་ཀྱི། འདི་སྙམ་དུ་དེང་བདག་གིས་ལུས་ཀྱི་ཤ་ཇི་ཙམ་བཅད་པ་དེ་ཙམ་དུ་འཁོར་བའི་སྡུག་བསྔལ་གྱི་ཕྱོགས་ཀྱང་དེ་ཙམ་ཞིག་འགག་པར་འགྱུར་རོ་སྙམ་དུ་བསམས་ནས་ངས་ཡུན་རིང་པོར་རྟག་པར་དེ་ལྟར་སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་ལ་མོས་པར་གྱུར་ཏོ། །དེ་ལྟར་སྦྱིན་པ་བཏང་ཡང་རབ་ཏུ་དགའ་ཞིང་བདེ་བ་ཐོབ་པར་གྱུར་པ་ཡིན་ཏེ།
en: However, Maudgalyāyana, at that time I never felt any regret, sense of loss, sorrow, or depression. Instead, for a long time I continued my aspiration to practice such generosity with the thought, ‘The more flesh I cut off from my body, the more suffering in saṃsāra will come to an end.’ Therefore, even though I practiced generosity in that way, I always felt utterly joyful and happy.

source: རྒྱུ་དང་རྐྱེན་དེས་ན་དེ་བཞིན་གཤེགས་པ་ནི་སེམས་ཅན་རྣམས་ལ་ཐུགས་རྗེ་ཆེན་པོ་རབ་ཏུ་མང་བ་ཡིན་པར་རིག་པར་བྱའོ།
en: You should know that, for those reasons, the Thus-Gone One is extremely compassionate toward sentient beings.

source: །གཞན་ཡང་མཽད་གལ་ངས་མངོན་པར་དྲན་ཏེ། སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་རྒྱལ་པོ་སྟོབས་པ་ཆེ་ཞེས་བྱ་བ་ཡོན་ཏན་གྱི་མཐུ་ཆེན་པོ་དང་ལྡན་པ་དགེ་བའི་རྩ་བ་རབ་ཏུ་བསགས་པ་ཞིག་བྱུང་ངོ་།
en: “Furthermore, Maudgalyāyana, I remember that in the past, there was a king called Mahābala who possessed the great power of excellent qualities and had accumulated many roots of virtue.

source: །དེའི་ཚེ་རྒྱལ་པོ་སྟོབས་པོ་ཆེ་འདི་སྙམ་དུ་དེང་བདག་གིས་ཅིའི་ཕྱིར་མཆོད་སྦྱིན་ཆེན་པོ་བཤམས་ནས་སེམས་ཅན་རྣམས་ཚིམ་པར་མི་བྱེད་སྙམ་མོ། །
en: At that time, King Mahābala told himself, ‘I should henceforth arrange elaborate offerings and gifts and satisfy sentient beings!’ So he prepared such great offerings and gifts; he gave away food to those who wished for food, and drink to those who wished for drink.

source: དེ་སྙམ་དུ་བསམས་ནས་མཆོད་སྦྱིན་ཆེན་པོ་བཤམས་ནས་བཟའ་བ་འདོད་པ་ལ་བཟའ་བ། བཏུང་བ་འདོད་པ་ལ་བཏུང་བ། གོས་དང་། མལ་ཆ་དང་། གསེར་དང་། དངུལ་དང་། རིན་པ་ཆེའི་དངོས་པོ་དང་། ཤིང་རྟ་དང་། བཞོན་པ་དང་། ནོར་དང་། སྤུག་དང་། རྡོའི་སྙིང་པོ་དང་། ཤེལ་དང་། བཻ་དཱུརྱ་དང་། བྱི་རུ་དང་། མན་ཤེལ་ལ་སོགས་པའི་རིན་པོ་ཆེ་དང་། མེ་ཏོག་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། སྤོས་ཀྱི་ཕྱེ་མ་དང་། དར་གྱི་ལྡ་ལྡི་དང་། གདུགས་དང་། རྒྱལ་མཚན་དང་། བུ་དང་། བུ་མོ་དང་། བྲན་ཕོ་དང་། བྲན་མོ་དང་། ལས་བྱེད་པ་དང་། རྟ་དང་། གླང་པོ་ཆེ་དང་། བ་ལང་དང་། ལུག་དང་། ཞིང་གི་དངོས་པོ་འདོད་པ་དག་ལ་ཡང་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་དགའ་མགུར་སྦྱར་ནས་ཐམས་ཅད་ཡོངས་སུ་བཏང་ངོ་།
en: Similarly, he gave away clothing, bedding, gold, silver, precious substances, chariots, mounts, and wealth; precious gems such as cat’s eye, emerald, crystal, beryl, coral, and moonstone; and flowers, perfumes, garlands, ointments, fragrant powders, silken streamers, parasols, banners, boys, girls, male servants, female servants, workers, horses, elephants, oxen, sheep, and fields. He joyfully gave away all those things to those who wished for them.

source: །མཽད་གལ་རྒྱལ་པོ་སྟོབས་པོ་ཆེས་དེ་ལྟར་སྦྱིན་པ་རྒྱ་ཆེར་བཏང་བ་དང་། དེའི་ཚེ་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་འདི་སྙམ་དུ་བདག་གིས་ཅིའི་ཕྱིར་རྒྱལ་པོ་འདི་ལ་བར་ཆད་བྱས་ཏེ་འབྲས་བུ་མི་ཐོབ་པར་བྱ་སྙམ་དུ་བསམས་ནས་དེ་ནས་བྲམ་ཟེ་ཞིག་ཏུ་སྤྲུལ་ཏེ། རྒྱལ་པོ་དེ་ག་ལ་བ་དེར་སོང་ནས་རྒྱལ་པོ་ལ་འདི་སྐད་ཅེས་དྲིས་སོ། །ཀྱེ་མཆོད་སྦྱིན་ཆེན་པོའི་འདུས་པ་འདིར་དངོས་པོ་ཇི་ལྟ་བུ་ཞིག་ཡོངས་སུ་གཏོང་།
en: “Maudgalyāyana, in that way, King Mahābala practiced generosity on a vast scale. At that time, Śakra, lord of the gods, thought, ‘I should create obstacles for this king, to prevent him from reaping the fruits of his offerings!’ With this thought in mind, he manifested himself as a brahmin, went to the place where the king was residing, and asked, ‘What kind of things are you giving away in this great offering that you have arranged?’

source: རྒྱལ་པོས་སྨྲས་པ། བྲམ་ཟེ་བདག་ལ་ནོར་ཅི་བདོག་པ་ཐམས་ཅད་ཡོངས་སུ་བཏང་བས་ཕངས་པ་ཅི་ཡང་མེད་དོ།
en: “The king replied, ‘Brahmin, I am giving away all the wealth that I possess, without any reservations.’

source: །བྲམ་ཟེས་སྨྲས་པ། ཁྱོད་ཀྱི་ཡི་དམ་དེ་ལྟ་བུ་ཡིན་ན་དེང་བདག་གིས་སློང་བ་གང་ཡིན་པ་དེ་སྦྱིན་པར་ནུས་སམ།
en: “The brahmin continued, ‘If such is your promise, are you able to give me what I ask for?’

source: རྒྱལ་པོ་སྟོབས་པོ་ཆེས་སྨྲས་པ། བདག་གིས་ཅི་བདོག་པ་ཐམས་ཅད་ཟད་པར་གཏང་ངོ་ཞེས་མ་སྨྲས་སམ།
en: “ ‘Haven’t I already said that I am giving away everything I possess?’ replied King Mahābala.

source: བྲམ་ཟེས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་གལ་ཏེ་དེ་ལྟ་ན་དེང་བདག་ནི་རྒྱལ་པོའི་ལུས་ཀྱི་ཡན་ལག་འདོད་དོ།
en: “ ‘Your Majesty,’ said the brahmin, ‘if this is so, I want the limbs of your body.’

source: །རྒྱལ་པོས་བསམས་པ། བྲམ་ཟེ་འདི་ནི་ནོར་ཟས་འདོད་པ་མ་ཡིན་གྱི།
en: “The king thought, ‘This brahmin does not wish for wealth or food.

source: དེང་འདིར་འོངས་ནས་བདག་གི་མཆོད་སྦྱིན་ཆེན་པོ་གཞིག་པར་འདོད་པ་ཡིན་ཏེ།
en: He came here today with the wish to disrupt my great offering.

source: བདག་གིས་གལ་ཏེ་ལུས་ཀྱི་ཡན་ལག་མ་བྱིན་ན་ནི་བདག་ཉིད་ཀྱིས་རང་གི་མཆོད་སྦྱིན་ཆེན་པོ་བཤིག་པར་འགྱུར་རོ་སྙམ་དུ་བསམས་ནས་བྲམ་ཟེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཁྱོད་ལ་ལུས་ཀྱི་ཡན་ལག་སྦྱིན་གྱིས་ཆོད་ལ་ཁྱེར་ཅིག །
en: If I do not give him the limbs of my body, my great offering will be disrupted.’ So he said to the brahmin, ‘I will give you the limbs of my body; I will cut them off and you can take them with you.’

source: བྲམ་ཟེས་སྨྲས་པ། ཀྱེ་རྒྱལ་པོ་ཆེན་པོ་དེང་དེ་སྐད་སྨྲས་པ་འདི་ལ་འགྱོད་པར་གྱུར་པ་ལྟ་མེད་དམ།
en: “ ‘Your Majesty,’ answered the brahmin, ‘will you not regret the words you are pronouncing now?’

source: རྒྱལ་པོ་སྟོབས་པོ་ཆེས་སྨྲས་པ། བདག་གི་སེམས་ལ་འགྱོད་པ་མེད་དེ།
en: “ ‘I will not have any regrets,’ said King Mahābala.

source: དེང་སློང་བ་མང་པོ་ཕྱོགས་བཞི་ནས་འདུས་ཏེ་འོངས་ན་ཡང་བདག་གིས་ཐམས་ཅད་ཚིམ་པར་བྱའོ་སྙམ་མོ།
en: ‘Even if a horde of beggars should come here today from the four directions, I would satisfy them all.’

source: །བྲམ་ཟེས་སྨྲས་པ། དེང་བདག་གཅིག་པུ་ཚིམ་པར་བྱ་བ་ཡང་དཀའ་ན་གཞན་མང་པོ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས།
en: “The brahmin said, ‘If it is so difficult to satisfy me alone, it goes without saying that it will be difficult to satisfy all the many others!’

source: དེ་ནས་རྒྱལ་པོ་སྟོབས་པོ་ཆེས་མཚོན་རྣོན་པོས་རང་གི་ལག་པ་བཅད་ནས་བྲམ་ཟེ་ལ་ཁྱེད་ཀྱིས་ལག་པ་འདི་གཅིག་ཁྱེར་ཅིག་ཅེས་སྨྲས་སོ།
en: “Then King Mahābala took a sharp knife, cut off one of his hands, and said to the brahmin, ‘Take this hand with you.’

source: །མཽད་གལ་རྒྱལ་པོ་སྟོབས་པོ་ཆེས་རང་གི་ལག་པ་བཅད་པའི་ཚེ་སེམས་ལ་གྱུར་ཞིང་འགྱོད་པ་མེད་པར་གྱུར་ཏེ།
en: “Maudgalyāyana, when King Mahābala cut off his hand, his mind did not waver, and he did not feel any regret.

source: དེ་ལྟར་སེམས་རྩེ་གཅིག་ཏུ་སྦྱིན་པ་ཡོངས་སུ་བཏང་བའི་ཕྱིར་དང་། ཐམས་ཅད་ཡོངས་སུ་བཏང་བའི་ཕྱིར་ལག་པ་ཡང་སྔ་མ་ཁོ་བཞིན་དུ་གྱུར་ཏོ།
en: Since he had practiced generosity one-pointedly and had given away all his possessions in that way, his hand remained unharmed.

source: །དེའི་ཚེ་རྒྱལ་པོ་སྟོབས་པ་ཆེས་མཚོན་གྱིས་ལུས་ཀྱི་ཡན་ལག་བཅད་ནས་བྲམ་ཟེ་ལ་བྱིན་ཡང་སླར་སྐྱེས་པར་གྱུར་ཏོ།
en: Then King Mahābala cut off the other limbs of his body with the knife and gave them to the brahmin, but they reappeared.

source: །མཽད་གལ་དེའི་ཚེ་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་ཡང་རྒྱུ་དང་རྐྱེན་དེས་ན་ལྷའི་བསོད་ནམས་ཟད་ནས་སེམས་ཡོངས་སུ་གདུང་ཞིང་སྡུག་བསྔལ་བས་འོ་དོད་ཆེན་པོ་བོས་ཏེ་ལུས་དེ་ཉིད་ཀྱིས་མངོན་དུ་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པར་ལྷུང་བར་གྱུར་ཏོ།
en: Maudgalyāyana, as a consequence, however, the divine merit of Śakra, lord of the gods, became exhausted. Experiencing intense pain and suffering, he cried out loudly and fell into the great Hell of Ceaseless Torment in that very body.

source: །མཽད་གལ་ཁྱོད་ཀྱིས་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་སྟོབས་པོ་ཆེས་ལུས་ཡོངས་སུ་བཏང་བ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ། དེ་ནི་ང་ཉིད་ཡིན་ནོ།
en: “Maudgalyāyana, at that time, I was King Mahābala, who gave away his body. Do not think that this was someone else.

source: །དེའི་ཚེ་དེའི་དུས་ན་བརྒྱ་བྱིན་ལྷའི་དབང་པོ་མཆོད་སྦྱིན་ཆེན་པོའི་བར་ཆད་བྱ་བར་འདོད་པ་དེ་གཞན་ཡིན་པ་སྙམ་དུ་སེམས་ན་དེ་ལྟར་མི་བལྟ་སྟེ། དེ་ནི་ལྷས་བྱིན་འདི་ཉིད་ཡིན་ནོ། །
en: And Devadatta was Śakra, lord of the gods, who wished to create obstacles to the king’s great offering. Do not think that this was someone else either.

source: མཽད་གལ་དེའི་ཚེ་ཡང་ལྷས་བྱིན་བླུན་པོས་ཕྲག་དོག་དང་ཞེ་སྡང་གི་བསམ་པས་ངའི་སྦྱིན་པའི་བར་ཆད་བྱ་བར་འདོད་པ་ལས་གཞིག་པར་མ་ནུས་ཏེ། སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་ལྷུང་བར་གྱུར་ཏོ།
en: Maudgalyāyana, at that time, the foolish Devadatta wanted to create obstacles to my offering out of jealousy and anger, but he could not disrupt it. Instead, he fell into that great hell.

source: །ངས་དེང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཆོས་ཀྱི་མཆོད་སྦྱིན་བཤམས་པ་ན་ཡང་ལྷས་བྱིན་བླུན་པོ་ད་དུང་ཞེ་སྡང་དང་ཕྲག་དོག་གི་བསམ་པས་རྙེད་པ་ལ་མངོན་པར་ཞེན་པའི་ཕྱིར་འཁོར་མང་པོ་ཁ་བསྡུས་ནས་ང་ལ་གསོད་པར་འདོད་པ་ཡིན་ནོ།
en: “Accordingly, now that I have awakened to unsurpassed and perfect buddhahood, whenever I arrange an offering of the Dharma, the foolish Devadatta, who is motivated by jealousy and anger, still desires to profit so badly that he gathers many people with the wish to kill me.

source: །ང་སྔོན་བྱ་རྒོད་ཕུང་པོའི་རིའི་ཤོད་དུ་འཆག་པ་ལས་ལྷས་བྱིན་བདག་ཉིད་རིའི་སྟེང་དུ་འཛེགས་ནས་འཁྲུལ་འཁོར་གྱིས་རྡོ་འཕངས་ཏེ།
en: Once in the past, when I was descending Vulture Peak Mountain, Devadatta climbed to the top of the mountain and hurled stones at me with the use of a catapult.

source: བདག་ཉིད་ཀྱི་དགེ་བའི་རྩ་བ་བཤིག་ནས་ང་ལ་ངན་སེམས་བསྐྱེད་པས་བདག་ཉིད་ཀྱི་རྙེད་པ་དང་འབྱོར་པའི་མཐུ་ཉམས་པར་བྱས་ནས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པར་ལྷུང་བ་ཡིན་ནོ།
en: He thereby destroyed his roots of virtue and, because he had given rise to such malice toward me, all his gains and wealth were ruined, and he will fall into the great Hell of Ceaseless Torment.

source: །མཽད་གལ་ངས་ནི་ལྷས་བྱིན་བླུན་པོ་ལ་ལུས་དང་། ངག་དང་། ཡིད་ཀྱིས་ཉེས་པ་བྱས་པ་མེད་ཀྱང་ཡུན་རིང་པོ་ནས་ང་ལ་དགྲར་འདུ་ཤེས་སོ།
en: Although, Maudgalyāyana, I have never done anything bad, whether physically, verbally, or mentally, to the foolish Devadatta, he has persistently perceived me as his enemy.

source: །ཚེ་རབས་ཐམས་ཅད་དུ་ངས་དགེ་བའི་ཆོས་མངོན་པར་སྒྲུབ་པའི་བར་ཆད་བྱ་བར་བརྩམས་ཀྱང་ངའི་དགེ་བ་སྤྱོད་པའི་བར་ཆད་བྱ་བར་མ་ནུས་སོ།
en: In all my lives, he has sought to create obstacles to my virtuous practice, but he has never been able to disrupt my virtuous conduct.

source: །ངས་ནི་ཡུན་རིང་པོ་ནས་རྟག་པར་བྱམས་པ་དང་། སྙིང་རྗེས་ཕན་བཏགས་ཀྱིས་ང་ལ་ཉེས་པའི་འདུ་ཤེས་སྐྱེད་པ་མེད་དོ། །མཽད་གལ་ལྷས་བྱིན་ནི་ཚེ་རབས་ཐམས་ཅད་དུ་ངས་བྱས་པའི་དྲིན་མི་གཟོ་བས་ངས་དེང་ལྷས་བྱིན་དང་འདྲ་བ་དག་ཀྱང་ལྷ་དང་མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱིས་དྲིན་མི་ཤེས་པར་བསྟན་ཏེ།
en: For a long time, I have continued to benefit him out of love and compassion, but he has always perceived me as an evil person. Still, Maudgalyāyana, since Devadatta has never been grateful for my help during all those lifetimes, it shows that beings like Devadatta will also not be grateful toward the entire world, with its gods, humans, and demigods.

source: དེ་ལྟ་བུའི་སྐྱེ་བོ་དེ་དག་ནི་ལོག་པ་ཉིད་དུ་ངེས་པའི་གནས་སུ་ཞུགས་པ་ཡིན་ནོ།
en: Such beings have entered a state that is certainly mistaken.

source: །མཽད་གལ་ལྷས་བྱིན་གྱིས་འཆི་བའི་དུས་བྱས་ནས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོར་མནར་མེད་པར་འཇུག་པའི་ཚེ་གདོད་ང་ལ་ལྷག་པའི་བསམ་པ་བཟང་པོ་སྐྱེ་བར་འགྱུར་ཏེ།
en: “Maudgalyāyana, when Devadatta passes away and enters the great Hell of Ceaseless Torment, an excellent and noble attitude toward me will be born in his mind for the first time.

source: འདི་ཡང་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱི་མཐུ་ཡིན་ནོ།
en: This is the power of the Thus-Gone One’s blessings.

source: །ལྷས་བྱིན་བྱས་པའི་དྲིན་མི་ཤེས་པའི་མཆོག་ཏུ་གྱུར་པས་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པར་འཇུག་ཏུ་ཉེ་བའི་ཚེ་སྒྲ་ཆེན་པོ་འདི་སྐད་དུ་ལྷས་བྱིན་བླུན་པོ་ཁྱོད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་ཞེ་སྡང་གི་སེམས་བསྐྱེད་པ་དང་། གསད་པར་བྱ་བ་མ་ཡིན་པ་ལ་ནན་གྱིས་གསོད་སེམས་བསྐྱེད་པའི་ཁ་ན་མ་ཐོ་བའི་རྒྱུ་དང་རྐྱེན་གྱིས་དེང་སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པར་ལྷུང་བ་ཡིན་ནོ་ཞེས་བསྒོ་བ་ཐོས་པས་ཤིན་དུ་སྐྲག་ནས་གདོད་དུལ་བར་གྱུར་ཏེ།
en: Since the ingratitude of Devadatta is enormous, he is destined for the great Hell of Ceaseless Torment. Then, just as he is about to enter that hell, he will hear a loud voice saying, ‘Foolish Devadatta, due to your wrongdoings, getting angry at the Blessed One and persistently plotting to kill someone who should not be killed, you will now fall into the great Hell of Ceaseless Torment.’ “Upon hearing those words, Devadatta will be terrified and subdued for the first time.

source: འདི་སྐད་དུ་དེང་བདག་ཤ་དང་རུས་པས་གཏུགས་ཏེ་སེམས་རྩེ་གཅིག་ཏུ་བཅོམ་ལྡན་འདས་ལ་སྐྱབས་སུ་མཆིའོ་ཞེས་སྨྲས་པས་སེམས་བདེ་བ་ཐོབ་པར་གྱུར་ཏོ།
en: He will therefore cry, ‘I take refuge in the Blessed One one-pointedly, from the depths of my heart and from the marrow of my bones!’ Then, as he cries this out, he will find happiness.

source: །དེ་བཞིན་གཤེགས་པ་ལ་མངོན་པར་ཡིད་ཆེས་པ་བསྐྱེད་ནས་སྒྲ་ཆེན་པོ་ཕྱུང་སྟེ། སེམས་ཅན་དམྱལ་བ་ཆེན་པོ་མནར་མེད་པར་ཞུགས་པའི་རྒྱུ་དང་རྐྱེན་དེས་ན་ཕྱིས་སེམས་ཅན་དམྱལ་བ་ལས་ཐར་ནས་མིར་སྐྱེས་ཏེ་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ནས་ལམ་ཡང་དག་པར་བསྒོམས་པས་རང་སངས་རྒྱས་ཀྱི་འབྲས་བུ་འཐོབ་པར་འགྱུར་ཏེ་མིང་ཡང་རུས་པ་ཅན་ཞེས་བྱ་བར་འགྱུར་རོ།
en: Having developed sincere trust in the Thus-Gone One, he will next hear a loud voice saying, ‘You have now entered into the great Hell of Ceaseless Torment, but you shall later be liberated from this hell, be reborn as a human, and renounce your household to go forth. Then, by practicing genuinely on the path, you shall achieve the fruition of a solitary buddha. You will be called The Determined One.

source: །མཽད་གལ་ངས་དེང་ལྷས་བྱིན་ལ་རང་སངས་རྒྱས་སུ་འགྱུར་བར་ལུང་བསྟན་པ་ཉིད་ཀྱིས་འཁོར་བའི་སྡུག་བསྔལ་ལས་ཡོངས་སུ་བཟླས་པ་ཡིན་ནོ།
en: “Maudgalyāyana, with this prophecy of Devadatta becoming a solitary buddha, I have now freed him from the sufferings of saṃsāra.

source: །མཽད་གལ་ངས་ལྷས་བྱིན་ཡོངས་སུ་བཟླས་པ་ནི་ངའི་སྔོན་གྱི་སྨོན་ལམ་ཇི་ལྟ་བ་བཞིན་དུ་གྱུར་པ་ཡིན་ནོ།
en: Maudgalyāyana, the fact that I have liberated Devadatta is in accordance with the aspirations I made in the past.

source: ངས་ཚེ་རབས་སྔ་མ་ལ་ལྷས་བྱིན་ཡོངས་སུ་བཟླ་བར་དམ་བཅས་པས་ངས་ཁྱོད་ཡོངས་སུ་བཟླ་བར་བྱའི་གཞན་གྱིས་བཟླ་བར་བྱ་བ་མེད་དོ་ཞེས་སྨྲས་པས་སོ། །མཽད་གལ་ལྷས་བྱིན་ནི་ང་འབའ་ཤིག་ལས་མྱ་ངན་ལས་འདས་པའི་རྒྱུ་དང་རྐྱེན་བསྐྱེད་པ་ཡིན་གྱི།
en: Because I took the commitment to liberate him in previous lifetimes by telling him, ‘I will liberate you, but others will not.’ Maudgalyāyana, it was only because of me that Devadatta created the causes and conditions to attain nirvāṇa.
